In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Load cleaned_aviation_data_US.csv
df = pd.read_csv('working-df/cleaned_aviation_data_US.csv')

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81355 entries, 0 to 81354
Data columns (total 28 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Event_Id                81355 non-null  object
 1   Investigation_Type      81355 non-null  object
 2   Accident_Number         81355 non-null  object
 3   Event_Date              81355 non-null  object
 4   Location                81355 non-null  object
 5   Country                 81355 non-null  object
 6   Airport_Code            48431 non-null  object
 7   Airport_Name            50906 non-null  object
 8   Injury_Severity         81250 non-null  object
 9   Aircraft_damage         79453 non-null  object
 10  Aircraft_Category       81355 non-null  object
 11  Registration_Number     81253 non-null  object
 12  Make                    81334 non-null  object
 13  Model                   81317 non-null  object
 14  Amateur_Built           81335 non-null  object
 15  Number_of_Engines       79509 non-null  float64
 16  Engine_Type             81355 non-null  object
 17  FAR_Description         28132 non-null  object
 18  Purpose_of_flight       81355 non-null  object
 19  Total_Fatal_Injuries    81355 non-null  float64
 20  Total_Serious_Injuries  81355 non-null  float64
 21  Total_Minor_Injuries    81355 non-null  float64
 22  Total_Uninjured         81355 non-null  float64
 23  Weather_Condition       81355 non-null  object
 24  Broad_phase_of_flight   81355 non-null  object
 25  Report_Status           78756 non-null  object
 26  Publication_Date        68835 non-null  object
 27  State                   81355 non-null  object
dtypes: float64(5), object(23)
memory usage: 17.4+ MB

In [4]:
# Show State value_counts for AO
df[df['State'] == 'AO']['State'].value_counts()

State
AO    17
Name: count, dtype: int64

In [5]:
# Rename AO 'Atlantic Ocean' in State column
df.loc[df['State'] == 'AO', 'State'] = 'Atlantic Ocean'

In [6]:
df[df['State'] == 'Atlantic Ocean']['State'].value_counts()

State
Atlantic Ocean    17
Name: count, dtype: int64

In [7]:
df['State'].value_counts()

State
CA                  8700
TX                  5839
FL                  5732
AK                  5625
AZ                  2804
                    ...
High Island 138,       1
Vermillion 229,        1
Atlantic Ocean,        1
Charlotte Amali,       1
CB                     1
Name: count, Length: 97, dtype: int64

In [8]:
# Rename 'Atlantic Ocean,' 'Atlantic Ocean' in State column
df.loc[df['State'] == 'Atlantic Ocean,', 'State'] = 'Atlantic Ocean'

In [12]:
# Show State value_counts over 1 and under 15
print(df['State'].value_counts()[df['State'].value_counts() < 15])

State
PO                           14
Unknown                      11
Gulf of Mexico,               9
GU                            8
VI                            6
Tamuning,                     5
Unknown,                      4
Pacific Ocean,                4
,                             3
St. Croix,                    3
UN                            3
Saipan,                       3
Charlotte Amalie,             3
Obyan,                        2
GULF OF MEXICO,               1
Guayaquil,                    1
LA,                           1
Majuro,                       1
Santa Rita,                   1
South Timbalier 127,          1
Whitney,                      1
Viosca Knoll 989,             1
South Timbalier Platform,     1
Eugene Island 182A,           1
Inarajan,                     1
West Delta 109,               1
Main Pass 61A,                1
Tinian Island,                1
Ship Shoal 208H,              1
Southern Timbalier 52CA,      1
Gulf Of Mexico,               1
South Pass 93A,               1
Agana,                        1
Mobile Block 114CC,           1
St. Thomas,                   1
High Island A-442A,           1
Christiansted,                1
High Island 138,              1
Vermillion 229,               1
Charlotte Amali,              1
CB                            1
Name: count, dtype: int64

In [13]:
df.loc[df['State'] == 'Pacific Ocean,', 'State'] = 'Pacific Ocean'

In [14]:
df.loc[df['State'] == 'PO', 'State'] = 'Pacific Ocean'

In [16]:
df[df['State'] == 'Pacific Ocean']['State'].value_counts()

State
Pacific Ocean    18
Name: count, dtype: int64

In [18]:
# rename all Gulf of Mexico instances
df.loc[df['State'].apply(lambda x: x in ['Gulf of Mexico,', 'GULF OF MEXICO,', 'Gulf Of Mexico,', 'GM']), 'State'] = 'Gulf of Mexico'

In [20]:
df[df['State'] == 'Gulf of Mexico']['State'].value_counts()

State
Gulf of Mexico    55
Name: count, dtype: int64

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81355 entries, 0 to 81354
Data columns (total 28 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Event_Id                81355 non-null  object
 1   Investigation_Type      81355 non-null  object
 2   Accident_Number         81355 non-null  object
 3   Event_Date              81355 non-null  object
 4   Location                81355 non-null  object
 5   Country                 81355 non-null  object
 6   Airport_Code            48431 non-null  object
 7   Airport_Name            50906 non-null  object
 8   Injury_Severity         81250 non-null  object
 9   Aircraft_damage         79453 non-null  object
 10  Aircraft_Category       81355 non-null  object
 11  Registration_Number     81253 non-null  object
 12  Make                    81334 non-null  object
 13  Model                   81317 non-null  object
 14  Amateur_Built           81335 non-null  object
 15  Number_of_Engines       79509 non-null  float64
 16  Engine_Type             81355 non-null  object
 17  FAR_Description         28132 non-null  object
 18  Purpose_of_flight       81355 non-null  object
 19  Total_Fatal_Injuries    81355 non-null  float64
 20  Total_Serious_Injuries  81355 non-null  float64
 21  Total_Minor_Injuries    81355 non-null  float64
 22  Total_Uninjured         81355 non-null  float64
 23  Weather_Condition       81355 non-null  object
 24  Broad_phase_of_flight   81355 non-null  object
 25  Report_Status           78756 non-null  object
 26  Publication_Date        68835 non-null  object
 27  State                   81355 non-null  object
dtypes: float64(5), object(23)
memory usage: 17.4+ MB